---
kind: property
id: P:Autodesk.Revit.DB.View3D.IsLocked
zh: 三维视图、3d视图
source: html/82235c3c-433d-7c90-bd53-7e4adfeed725.htm
---
# Autodesk.Revit.DB.View3D.IsLocked Property

**中文**: 三维视图、3d视图

Indicates if the view is locked.

## Syntax (C#)
```csharp
public bool IsLocked { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Returns true if the view is not a view template.